12/data/attachments/f40f3b4a4b1977e7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brian_statement_Friend_17751_7</nif:username>
            <nif:friendToBeRequested>soap_friends_969af944-d2f4-4ef0-a2bb-438e86edbf98</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>